<?php

use yii\db\Migration;

/**
 * Class m240415_154853_insert_new_concursos
 */
class m240415_154853_insert_new_concursos extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {

        $this->batchInsert(
            "area_departamento",
            ["id_area_departamento", "id_facultad", "descripcion_area_departamento", "activa"],
            [
                [419, 2, 'Carrera de Arquitectura', 1],
                [420, 5, 'Carrera de Ciencia Política', 1],
                [421, 2, 'Carrera de Diseño Industrial', 1],
                [422, 9, 'Departamento de Ciencias de la Educación', 1],
                [423, 11, 'Departamento de Ciencias Fisiológicas', 1],
                [424, 7, 'Departamento de Ciencias Sociales', 1],
                [425, 7, 'Departamento de Derecho del Trabajo y de la Seguridad Social', 1],
                [426, 7, 'Departamento de Derecho Privado I', 1],
                [427, 7, 'Departamento de Derecho Privado II', 1],
                [428, 1, 'Departamento de Economía, Desarrollo y Planeamiento Agrícola', 1],
                [429, 10, 'Departamento de Electrónica', 1],
                [430, 9, 'Departamento de Filosofía', 1],
                [431, 7, 'Departamento de Filosofía del Derecho', 1],
                [432, 9, 'Departamento de Historia', 1],
                [433, 1, 'Departamento de Producción Animal', 1],
                [434, 10, 'Departamento de Química', 1],
                [435, 1, 'Secretaría Académica', 1]
            ]
        );

        $this->batchInsert(
            "concurso",
            ["numero_expediente", "id_tipo_concurso", "id_facultad", "id_categoria", "id_dedicacion", "id_area_departamento", "cantidad_de_puestos", "fecha_inicio_inscripcion", "fecha_fin_inscripcion", "hora_inicio_inscripcion", "hora_fin_inscripcion", "fecha_publicacion", "cantidad_dias_publicacion", "area"],
            [
                ['EX-2023-05547205-   -UBA-DMESA#SSA_FAGRO', 4, 1, 3, 3, 433, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Mejoramiento Animal'],
                ['EX-2023-05547498-   -UBA-DMESA#SSA_FAGRO', 4, 1, 3, 2, 428, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Turismo Rural'],
                ['EX-2023-05558800-   -UBA-DMESA#SSA_FAGRO', 1, 1, 3, 3, 435, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Agroecología'],
                ['EX-2023-05130655-   -UBA-DME#SH_FADU', 2, 2, 4, 1, 421, 2, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-07096619-   -UBA-DME#SH_FADU', 2, 2, 2, 1, 419, 3, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05233121-   -UBA-DMESA#FCEN', 3, 4, 4, 3, 414, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Sistemática de Plantas Vasculares'],
                ['EX-2023-05526193-   -UBA-DC#SA_FDER', 1, 7, 2, 2, 431, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05526785-   -UBA-DC#SA_FDER', 3, 7, 4, 1, 426, 7, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05527051-   -UBA-DC#SA_FDER', 2, 7, 2, 1, 425, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-05680517-   -UBA-DC#SA_FDER', 3, 7, 4, 1, 427, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-01518335-   -UBA-DME#FFYL', 2, 9, 2, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-02024410-   -UBA-DME#FFYL', 2, 9, 2, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-02899041-   -UBA-DME#FFYL', 2, 9, 4, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-02925712-   -UBA-DME#FFYL', 2, 9, 4, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-02925546-   -UBA-DME#FFYL', 2, 9, 4, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-02925342-   -UBA-DME#FFYL', 2, 9, 4, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-05767989-   -UBA-DME#FFYL', 2, 9, 2, 1, 15, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05008819-   -UBA-DME#FFYL', 2, 9, 4, 1, 430, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05988144-   -UBA-DME#FFYL', 2, 9, 4, 1, 422, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-01613440-   -UBA-DIMEDA#SA_FI', 4, 10, 4, 3, 434, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Química Analítica '],
                ['EX-2021-02823449-   -UBA-DIMEDA#SA_FI', 1, 10, 4, 3, 429, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Procesamiento de Señales e Información '],
                ['EX-2023-05284595-   -UBA-DIMEDA#SA_FI', 1, 10, 4, 1, 429, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Sistemas Embebidos y Digitales '],
                ['EX-2023-06873255-   -UBA-DMEA#FMED', 2, 11, 4, 1, 423, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Fisiología y Biofísica '],
                ['EX-2023-06873311-   -UBA-DMEA#FMED', 2, 11, 4, 1, 423, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Fisiología y Biofísica'],
                ['EX-2023-05122004-   -UBA-DMEDA#FODON', 4, 12, 4, 2, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Odontología Preventiva y Comunitaria'],
                ['EX-2023-05209089-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Odontología Integral del Adulto Mayor y Clínica de Prótesis Removible'],
                ['EX-2023-05205171-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Odontología Integral del Adulto Mayor y Clínica de Prótesis Removible'],
                ['EX-2023-05637956-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Endodoncia'],
                ['EX-2023-05637988-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Endodoncia'],
                ['EX-2023-05887652-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Endodoncia'],
                ['EX-2023-05887666-   -UBA-DMEDA#FODON', 4, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Endodoncia'],
                ['EX-2023-05799896-   -UBA-DDMEA#CBC', 1, 75, 2, 2, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Semiología'],
                ['EX-2023-07507148-   -UBA-DME#FCE', 4, 3, 3, 1, 115, 2, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-07507169-   -UBA-DME#FCE', 4, 3, 2, 1, 115, 2, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-07507197-   -UBA-DME#FCE', 4, 3, 4, 1, 115, 3, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2024-00408613-   -UBA-DMESA#SG_FVET', 2, 6, 2, 3, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2024-00408833-   -UBA-DMESA#SG_FVET', 2, 6, 4, 3, NULL, 2, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2021-02823430-   -UBA-DIMEDA#SA_FI', 1, 10, 4, 3, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Automatización y Control'],
                ['EX-2022-05552406-   -UBA-DME#SAHDU_FSOC', 1, 5, 4, 1, 420, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-05552982-   -UBA-DME#SAHDU_FSOC', 1, 5, 2, 1, 420, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2022-05553009-   -UBA-DME#SAHDU_FSOC', 1, 5, 4, 1, 420, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-02540788-   -UBA-DME#SAHDU_FSOC', 1, 5, 4, 1, 420, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-04171592-   -UBA-DME#SAHDU_FSOC', 1, 5, 3, 1, 39, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05526529-   -UBA-DC#SA_FDER', 1, 7, 2, 1, 112, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05526676-   -UBA-DC#SA_FDER', 1, 7, 4, 1, 426, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-05527142-   -UBA-DC#SA_FDER', 1, 7, 4, 1, 424, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Sociología Jurídica'],
                ['EX-2023-04958462-   -UBA-DME#FFYL', 1, 9, 4, 1, 432, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, NULL],
                ['EX-2023-01667745-   -UBA-DIMEDA#SA_FI', 1, 10, 4, 3, 434, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Área de docencia: Química Básica; Área de investigación: Preparación y caracterización de Nanomateriales Magnéticos Compuestos. Su aplicación en la Remoción de Contaminantes'],
                ['EX-2021-02705065-   -UBA-DIMEDA#SA_FI', 1, 10, 3, 1, 418, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Área de docencia: Todas las asignaturas del Departamento de Física'],
                ['EX-2023-05588381-   -UBA-DMEDA#FODON', 1, 12, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Ortodoncia'],
                ['EX-2023-04865618-   -UBA-DDMEA#CBC', 1, 75, 4, 2, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Ciencia Política'],
                ['EX-2023-05795413-   -UBA-DDMEA#CBC', 1, 75, 4, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Introducción al Conocimiento de la Sociedad y el Estado'],
                ['EX-2023-05795443-   -UBA-DDMEA#CBC', 1, 75, 3, 1, NULL, 1, '2024-04-15 09:00:00', '2024-05-13 18:00:00', '09:00', '18:00', '2024-04-12', 1, 'Ciencia Política'],
            ]
        );
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m240415_154853_insert_new_concursos cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m240415_154853_insert_new_concursos cannot be reverted.\n";

        return false;
    }
    */
}
